
Функция СоздатьФайлСценария(Сценарий, КодАвторизации = "") Экспорт
	
	Если Сценарий = Справочники.СценарииВыполненияАвторизации.ВводКода Тогда		
		ТекстСценария = СтрЗаменить(Сценарий.ТекстСценария, "000000", КодАвторизации);		
	Иначе		
		ТекстСценария = Сценарий.ТекстСценария;		
	КонецЕсли;
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xtsk");
	
	Текст = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);	
	Текст.Записать(ТекстСценария);		
	Текст.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура ЗаписатьЗадание(ВидЗадания, СтатусЗадания, КодАвторизации = "") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ЗаданияАвторизации.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 		  = ТекущаяДата();	
	МенеджерЗаписи.ВидЗадания 	  = ВидЗадания;
	МенеджерЗаписи.СтатусЗадания  = СтатусЗадания;
	МенеджерЗаписи.КодАвторизации = КодАвторизации;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
